<img src="https://github.com/danielscarvalho/data/blob/master/img/FIAP-logo.png?raw=True" style="float:right;" width="200px">

# DATA SCIENCE & STATISTICAL COMPUTING [》](https://www.fiap.com.br/)

## Dataframe & Python

### LAP Parte 1: “10 minutes to pandas"

https://pandas.pydata.org/docs/user_guide/10min.html

Sugestão: Colocar a página do Cookbook lado a lado com este notebook para realizar as operações.

In [5]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\usuario\appdata\local\programs\python\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\usuario\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\usuario\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\usuario\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\usuario\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\usuario\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:
import numpy as np
import pandas as pd

In [10]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : bdc79c146c2e32f2cab629be240f01658cfb6cc2
python                : 3.12.1.final.0
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : Intel64 Family 6 Model 158 Stepping 10, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : pt_BR.cp1252

pandas                : 2.2.1
numpy                 : 1.26.4
pytz                  : 2024.1
dateutil              : 2.9.0.post0
setuptools            : None
pip                   : 23.2.1
Cython                : None
pytest                : None
hypothesis            : None
sphinx                : None
blosc                 : None
feather               : None
xlsxwriter            : None
lxml.etree            : None
html5lib              : None
pymysql               : None
psycopg2              : None
jinja2                : None
IPython               : 8.22.2
pandas_datareader     : None
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
gcsfs                 : None
matplotlib            : None
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : None
pandas_gbq            : None
pyarrow               : None
pyreadstat            : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
zstandard             : None
tzdata                : 2024.1
qtpy                  : None
pyqt5                 : None

In [11]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [12]:
dates = pd.date_range("20130101", periods=6)

In [13]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [15]:
df

                   A         B         C         D
2013-01-01 -0.591708 -0.648058 -0.179425 -0.698518
2013-01-02 -0.099749  0.269675  0.199840  0.960359
2013-01-03  1.430517  0.692549  0.393773 -1.745330
2013-01-04 -0.296501 -1.793083 -2.488454 -1.425445
2013-01-05 -0.348796 -0.137193 -0.865909  0.334148
2013-01-06  0.098304  1.007577  0.136956 -0.031048

In [10]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [10]:
df.head()

                   A         B         C         D
2013-01-01 -1.350970  0.059306 -1.157924 -2.327499
2013-01-02 -0.072778  0.028151 -0.268992 -0.132020
2013-01-03 -0.174829 -0.358285  0.719643 -1.918939
2013-01-04 -0.332890 -0.830492 -0.775805 -0.112785
2013-01-05  0.003932 -0.376470 -0.311179 -0.815550

In [11]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.332890 -0.830492 -0.775805 -0.112785
2013-01-05  0.003932 -0.376470 -0.311179 -0.815550
2013-01-06 -0.884597 -1.753172 -1.663713  1.216495

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy()

array([[-1.3509695 ,  0.05930633, -1.15792379, -2.32749944],
       [-0.07277771,  0.02815074, -0.26899239, -0.1320202 ],
       [-0.1748286 , -0.35828549,  0.71964256, -1.91893882],
       [-0.33288993, -0.83049229, -0.7758045 , -0.11278454],
       [ 0.0039315 , -0.37646978, -0.31117877, -0.81555012],
       [-0.88459729, -1.75317217, -1.66371322,  1.2164945 ]])

In [15]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.468689 -0.538494 -0.576328 -0.681716
std    0.535968  0.677921  0.825197  1.302788
min   -1.350970 -1.753172 -1.663713 -2.327499
25%   -0.746670 -0.716987 -1.062394 -1.643092
50%   -0.253859 -0.367378 -0.543492 -0.473785
75%   -0.098290 -0.068458 -0.279539 -0.117593
max    0.003932  0.059306  0.719643  1.216495

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.350970   -0.072778   -0.174829   -0.332890    0.003932   -0.884597
B    0.059306    0.028151   -0.358285   -0.830492   -0.376470   -1.753172
C   -1.157924   -0.268992    0.719643   -0.775805   -0.311179   -1.663713
D   -2.327499   -0.132020   -1.918939   -0.112785   -0.815550    1.216495

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -2.327499 -1.157924  0.059306 -1.350970
2013-01-02 -0.132020 -0.268992  0.028151 -0.072778
2013-01-03 -1.918939  0.719643 -0.358285 -0.174829
2013-01-04 -0.112785 -0.775805 -0.830492 -0.332890
2013-01-05 -0.815550 -0.311179 -0.376470  0.003932
2013-01-06  1.216495 -1.663713 -1.753172 -0.884597

In [20]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.884597 -1.753172 -1.663713  1.216495
2013-01-04 -0.332890 -0.830492 -0.775805 -0.112785
2013-01-05  0.003932 -0.376470 -0.311179 -0.815550
2013-01-03 -0.174829 -0.358285  0.719643 -1.918939
2013-01-02 -0.072778  0.028151 -0.268992 -0.132020
2013-01-01 -1.350970  0.059306 -1.157924 -2.327499

In [21]:
df["A"]

2013-01-01   -1.350970
2013-01-02   -0.072778
2013-01-03   -0.174829
2013-01-04   -0.332890
2013-01-05    0.003932
2013-01-06   -0.884597
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.350970  0.059306 -1.157924 -2.327499
2013-01-02 -0.072778  0.028151 -0.268992 -0.132020
2013-01-03 -0.174829 -0.358285  0.719643 -1.918939

In [23]:
df[1:-1]

                   A         B         C         D
2013-01-02 -0.072778  0.028151 -0.268992 -0.132020
2013-01-03 -0.174829 -0.358285  0.719643 -1.918939
2013-01-04 -0.332890 -0.830492 -0.775805 -0.112785
2013-01-05  0.003932 -0.376470 -0.311179 -0.815550

In [24]:
df

                   A         B         C         D
2013-01-01 -1.350970  0.059306 -1.157924 -2.327499
2013-01-02 -0.072778  0.028151 -0.268992 -0.132020
2013-01-03 -0.174829 -0.358285  0.719643 -1.918939
2013-01-04 -0.332890 -0.830492 -0.775805 -0.112785
2013-01-05  0.003932 -0.376470 -0.311179 -0.815550
2013-01-06 -0.884597 -1.753172 -1.663713  1.216495

In [25]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.072778  0.028151 -0.268992 -0.132020
2013-01-03 -0.174829 -0.358285  0.719643 -1.918939
2013-01-04 -0.332890 -0.830492 -0.775805 -0.112785